###################################################################

# Created by write_sdc on Sun Nov 27 10:24:23 2022

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_input_delay -clock clk  -max 3  [get_ports rst_n]
set_input_delay -clock clk  -max 3  [get_ports {a_in[31]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[30]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[29]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[28]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[27]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[26]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[25]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[24]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[23]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[22]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[21]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[20]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[19]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[18]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[17]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[16]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[15]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[14]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[13]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[12]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[11]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[10]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[9]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[8]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[7]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[6]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[5]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[4]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[3]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[2]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[1]}]
set_input_delay -clock clk  -max 3  [get_ports {a_in[0]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[31]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[30]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[29]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[28]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[27]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[26]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[25]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[24]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[23]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[22]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[21]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[20]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[19]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[18]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[17]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[16]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[15]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[14]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[13]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[12]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[11]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[10]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[9]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[8]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[7]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[6]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[5]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[4]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[3]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[2]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[1]}]
set_input_delay -clock clk  -max 3  [get_ports {b_in[0]}]
set_input_delay -clock clk  -max 3  [get_ports {c_in[0]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[31]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[30]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[29]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[28]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[27]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[26]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[25]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[24]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[23]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[22]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[21]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[20]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[19]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[18]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[17]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[16]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[15]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[14]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[13]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[12]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[11]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[10]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[9]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[8]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[7]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[6]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[5]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[4]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[3]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[2]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[1]}]
set_output_delay -clock clk  -max 2.5  [get_ports {sum_out[0]}]
set_output_delay -clock clk  -max 2.5  [get_ports {c_out[0]}]
